#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # aws_dynamodb_table.lobbies will be created
  + resource "aws_dynamodb_table" "lobbies" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "Id"
      + id               = (known after apply)
      + name             = "pr1960202501-Lobbies"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Environment" = "pr1960202501"
          + "Project"     = "wheel-react-native"
          + "Terraform"   = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Id"
          + type = "S"
        }

      + ttl {
          + attribute_name = "TTL"
          + enabled        = true
        }
    }

  # aws_dynamodb_table.users will be created
  + resource "aws_dynamodb_table" "users" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "Id"
      + id               = (known after apply)
      + name             = "pr1960202501-Users"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Environment" = "pr1960202501"
          + "Project"     = "wheel-react-native"
          + "Terraform"   = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Id"
          + type = "S"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

#### OpenTofu Apply 🚀`success`

<details><summary>Apply Output</summary>

```


OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # aws_dynamodb_table.lobbies will be created
  + resource "aws_dynamodb_table" "lobbies" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "Id"
      + id               = (known after apply)
      + name             = "pr1960202501-Lobbies"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Environment" = "pr1960202501"
          + "Project"     = "wheel-react-native"
          + "Terraform"   = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Id"
          + type = "S"
        }

      + ttl {
          + attribute_name = "TTL"
          + enabled        = true
        }
    }

  # aws_dynamodb_table.users will be created
  + resource "aws_dynamodb_table" "users" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "Id"
      + id               = (known after apply)
      + name             = "pr1960202501-Users"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Environment" = "pr1960202501"
          + "Project"     = "wheel-react-native"
          + "Terraform"   = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Id"
          + type = "S"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_dynamodb_table.users: Creating...
aws_dynamodb_table.lobbies: Creating...
aws_dynamodb_table.users: Creation complete after 8s [id=pr1960202501-Users]
aws_dynamodb_table.lobbies: Creation complete after 8s [id=pr1960202501-Lobbies]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

#### Integration Tests 🧪`success`

<details><summary>Integration Tests Output</summary>

```


```

</details>

#### Cleanup Infrastructure 🧹`success`

<details><summary>Cleanup Output</summary>

```

[0m[1maws_dynamodb_table.lobbies: Refreshing state... [id=pr1960202501-Lobbies][0m
[0m[1maws_dynamodb_table.users: Refreshing state... [id=pr1960202501-Users][0m

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [31m-[0m destroy[0m

OpenTofu will perform the following actions:

[1m  # aws_dynamodb_table.lobbies[0m will be [1m[31mdestroyed[0m
[0m  [31m-[0m[0m resource "aws_dynamodb_table" "lobbies" {
      [31m-[0m[0m arn                         = "arn:aws:dynamodb:us-west-2:975050125701:table/pr1960202501-Lobbies" [90m-> null[0m[0m
      [31m-[0m[0m billing_mode                = "PAY_PER_REQUEST" [90m-> null[0m[0m
      [31m-[0m[0m deletion_protection_enabled = false [90m-> null[0m[0m
      [31m-[0m[0m hash_key                    = "Id" [90m-> null[0m[0m
      [31m-[0m[0m id                          = "pr1960202501-Lobbies" [90m-> null[0m[0m
      [31m-[0m[0m name                        = "pr1960202501-Lobbies" [90m-> null[0m[0m
      [31m-[0m[0m read_capacity               = 0 [90m-> null[0m[0m
      [31m-[0m[0m stream_enabled              = false [90m-> null[0m[0m
      [31m-[0m[0m table_class                 = "STANDARD" [90m-> null[0m[0m
      [31m-[0m[0m tags                        = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all                    = {
          [31m-[0m[0m "Environment" = "pr1960202501"
          [31m-[0m[0m "Project"     = "wheel-react-native"
          [31m-[0m[0m "Terraform"   = "true"
        } [90m-> null[0m[0m
      [31m-[0m[0m write_capacity              = 0 [90m-> null[0m[0m

      [31m-[0m[0m attribute {
          [31m-[0m[0m name = "Id" [90m-> null[0m[0m
          [31m-[0m[0m type = "S" [90m-> null[0m[0m
        }

      [31m-[0m[0m point_in_time_recovery {
          [31m-[0m[0m enabled = false [90m-> null[0m[0m
        }

      [31m-[0m[0m ttl {
          [31m-[0m[0m attribute_name = "TTL" [90m-> null[0m[0m
          [31m-[0m[0m enabled        = true [90m-> null[0m[0m
        }
    }

[1m  # aws_dynamodb_table.users[0m will be [1m[31mdestroyed[0m
[0m  [31m-[0m[0m resource "aws_dynamodb_table" "users" {
      [31m-[0m[0m arn                         = "arn:aws:dynamodb:us-west-2:975050125701:table/pr1960202501-Users" [90m-> null[0m[0m
      [31m-[0m[0m billing_mode                = "PAY_PER_REQUEST" [90m-> null[0m[0m
      [31m-[0m[0m deletion_protection_enabled = false [90m-> null[0m[0m
      [31m-[0m[0m hash_key                    = "Id" [90m-> null[0m[0m
      [31m-[0m[0m id                          = "pr1960202501-Users" [90m-> null[0m[0m
      [31m-[0m[0m name                        = "pr1960202501-Users" [90m-> null[0m[0m
      [31m-[0m[0m read_capacity               = 0 [90m-> null[0m[0m
      [31m-[0m[0m stream_enabled              = false [90m-> null[0m[0m
      [31m-[0m[0m table_class                 = "STANDARD" [90m-> null[0m[0m
      [31m-[0m[0m tags                        = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all                    = {
          [31m-[0m[0m "Environment" = "pr1960202501"
          [31m-[0m[0m "Project"     = "wheel-react-native"
          [31m-[0m[0m "Terraform"   = "true"
        } [90m-> null[0m[0m
      [31m-[0m[0m write_capacity              = 0 [90m-> null[0m[0m

      [31m-[0m[0m attribute {
          [31m-[0m[0m name = "Id" [90m-> null[0m[0m
          [31m-[0m[0m type = "S" [90m-> null[0m[0m
        }

      [31m-[0m[0m point_in_time_recovery {
          [31m-[0m[0m enabled = false [90m-> null[0m[0m
        }

      [31m-[0m[0m ttl {
          [31m-[0m[0m enabled = false [90m-> null[0m[0m
        }
    }

[1mPlan:[0m 0 to add, 0 to change, 2 to destroy.
[0m[0m[1maws_dynamodb_table.users: Destroying... [id=pr1960202501-Users][0m[0m
[0m[1maws_dynamodb_table.lobbies: Destroying... [id=pr1960202501-Lobbies][0m[0m
[0m[1maws_dynamodb_table.lobbies: Destruction complete after 2s[0m
[0m[1maws_dynamodb_table.users: Destruction complete after 4s[0m
[0m[1m[32m
Destroy complete! Resources: 2 destroyed.
[0m
```

</details>

*Pusher: @dependabot[bot], Action: `pull_request`, Workflow: `Pull Request`*